app/views/ambulances/_ambulance.html.erb

SELECT "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = 1 LIMIT 1
---
		<td >
			<% hospital = Hospital.find(ambulance.hospital_id) %>