app/views/ambulances/_form.html.erb

SELECT "hospitals".* FROM "hospitals"
---
	<%= ambulance.select :status, [['En Route','En Route'],['Delayed','Delayed'],['Arrived','Arrived'],['Transported','Transported']] %>
	<%= collection_select(:ambulance, :hospital_id,Hospital.all ,:id, :name) %>