app/views/ambulances/index.html.erb

REQUESTED AMBULANCES: <%= @incident.requested_amb_count %>
AMBULANCES SENT: <%= @incident.ambulances.count %><br />
---
SELECT "ambulances".* FROM "ambulances" WHERE ("ambulances".incident_id = 1)
SELECT COUNT(*) FROM "ambulances" WHERE ("ambulances".incident_id = 5)

    <td><%= ambulance.status %></td>
        <% @desthospital = Hospital.find(ambulance.hospital_id) %>
---
SELECT "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = 1 LIMIT 1