app/views/patients/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  <% end %>
  <% if User.find(current_user.id).role_id == 1 and @incident.status== true%>