app/controllers/ambulances_controller.rb

SELECT "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = 1 LIMIT 1
---
 def index
   @incident = Incident.find(params[:incident_id])
   @patients = @incident.patients.all
   @ambulance = @incident.ambulances.new
   @ambulances = @incident.ambulances.all

   @hospitals = Hospital.find :all, :conditions => ['is_deleted is not ? ', true]