app/controllers/ambulances_controller.rb

  def index

    @incident = Incident.find(params[:incident_id])
    @patients = @incident.patients.all
    @ambulance = @incident.ambulances.new
    @ambulances = @incident.ambulances.all  #Craig has: @ambulances = @incident.ambulances
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = 1 LIMIT 1
SELECT "ambulances".* FROM "ambulances" WHERE ("ambulances".incident_id = 1)

  def show
    @ambulance = Ambulance.find(params[:id])
---
SELECT "ambulances".* FROM "ambulances" WHERE "ambulances"."id" = 1 LIMIT 1

  def new
    @incident = Incident.find(params[:incident_id])
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = 1 LIMIT 1

  def edit
    @incident = Incident.find(params[:incident_id])
    @ambulance = @incident.ambulances.find(params[:id])
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = 1 LIMIT 1
SELECT "ambulances".* FROM "ambulances" WHERE "ambulances"."id" = 6 AND ("ambulances".incident_id = 1) LIMIT 1

  def create
    @incident = Incident.find(params[:incident_id])
    @ambulance = @incident.ambulances.new(params[:ambulance])
    @ambulance.adding_user_id = current_user.id

    if(@ambulance.eta < Time.now())
      @ambulance.eta = @ambulance.eta + 1.day
    end

    respond_to do |format|
      if @ambulance.save
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = 1 LIMIT 1
INSERT INTO "ambulances" ("eta", "patient_id", "created_at", "hospital_id", "idAmbulance", "status", "updated_at", "incident_id", "description") VALUES ('2011-10-26 18:50:00.000000', NULL, '2011-10-26 18:42:12.033947', 1, '1234', 'En Route', '2011-10-26 18:42:12.033947', 2, NULL)

  def update
    @incident = Incident.find(params[:incident_id])
    @ambulance = @incident.ambulances.find(params[:id])
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = 1 LIMIT 1
SELECT "ambulances".* FROM "ambulances" WHERE "ambulances"."id" = 6 AND ("ambulances".incident_id = 1) LIMIT 1

  def destroy
    @incident = Incident.find(params[:incident_id])
    @ambulance = @incident.ambulances.find(params[:id])
    if(@ambulance.idAmbulance != "Not yet defined")
      @ambulance.destroy
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = 1 LIMIT 1
SELECT "ambulances".* FROM "ambulances" WHERE "ambulances"."id" = 7 AND ("ambulances".incident_id = 1) LIMIT 1
DELETE FROM "ambulances" WHERE "ambulances"."id" = 3