app/controllers/hospitals_controller.rb

  def index
    @hospitals = Hospital.all
---
SELECT "hospitals".* FROM "hospitals"

  def show
    @hospital = Hospital.find(params[:id])
---
SELECT "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = 1 LIMIT 1

  def create
    @hospital = Hospital.new(params[:hospital])

    respond_to do |format|
      if @hospital.save
---
INSERT INTO "hospitals" ("idHospital", "created_at", "address", "name", "updated_at") VALUES (NULL, '2011-10-26 17:31:30.344888', '', 'Not Determined', '2011-10-26 17:31:30.344888')