app/controllers/incidents_controller.rb

SELECT "incidents".* FROM "incidents"
---
  def index
    @incidents = Incident.all

SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = 1 LIMIT 1
---
  def show
    @incident = Incident.find(params[:id])

SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = 5 LIMIT 1
---
  def edit
    @incident = Incident.find(params[:id])

INSERT INTO "incidents" ("endTime", "arrivalTime", "date", "est_patient_count", "longitude", "latitude", "idIncident", "incident_type", "updated_at", "requested_amb_count", "created_at", "dispatchTime", "location") VALUES (NULL, NULL, NULL, 0, 123.123, 321.321, NULL, 'Building Fire', '2011-10-26 17:29:31.889264', 0, '2011-10-26 17:29:31.889264', NULL, '1402 Turret Road Bel Air MD 21015')
---
  def create
    @incident = Incident.new(params[:incident])

    respond_to do |format|
      if @incident.save

SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = 1 LIMIT 1
UPDATE "incidents" SET "est_patient_count" = 23, "requested_amb_count" = 45, "updated_at" = '2011-10-26 01:16:53.593543' WHERE "incidents"."id" = 1
---
  def update
    @incident = Incident.find(params[:id])

    respond_to do |format|
      if @incident.update_attributes(params[:incident])