app/controllers/patients_controller.rb

  def index
    @incident = Incident.find(params[:incident_id])
    @patients = @incident.patients.all
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = 1 LIMIT 1
SELECT "patients".* FROM "patients" WHERE ("patients".incident_id = 1)

  def new
    @incident = Incident.find(params[:incident_id])
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = 1 LIMIT 1

  def create
    @incident = Incident.find(params[:incident_id])
    @patient = @incident.patients.create!(params[:patient])
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = 1 LIMIT 1
INSERT INTO "patients" ("tagColor", "updated_at", "complaint", "sex", "status", "numberOfTag", "idIncident", "created_at", "incident_id", "age", "ageType") VALUES ('Yellow', '2011-10-26 23:22:48.341623', 'leg fracture', 'Male', NULL, 1, NULL, '2011-10-26 23:22:48.341623', 3, 20, 'Years')

  def update
    @incident = Incident.find(params[:incident_id])
    @patient = @incident.patients.find(params[:id])
    @temp_patient=@patient.clone

    respond_to do |format|
      if(params[:patient])
        if @patient.update_attributes(params[:patient])
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = 1 LIMIT 1
SELECT "patients".* FROM "patients" WHERE "patients"."id" = 3 AND ("patients".incident_id = 1) LIMIT 1
UPDATE "patients" SET "complaint" = 'Some injuryasdfasdf', "updated_at" = '2011-10-19 20:49:33.017163' WHERE "patients"."id" = 2

  def destroy
    @incident = Incident.find(params[:incident_id])
    @patient = @incident.patients.find(params[:id])
    @patient.destroy
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = 1 LIMIT 1
SELECT "patients".* FROM "patients" WHERE "patients"."id" = 3 AND ("patients".incident_id = 1) LIMIT 1
DELETE FROM "patients" WHERE "patients"."id" = 1