app/controllers/responders_controller.rb

SELECT "responders".* FROM "responders"
---
  def index
    @responders = Responder.all