app/controllers/user_sessions_controller.rb

SELECT "users".* FROM "users" WHERE ("users".username LIKE 'craig') LIMIT 1
---
  def create
    @user_session = UserSession.new(params[:user_session])

    respond_to do |format|
      if @user_session.save
        if User.find(current_user.id).role_id == 3