app/controllers/users_controller.rb

INSERT INTO "users" ("password_salt", "username", "created_at", "updated_at", "email", "crypted_password", "persistence_token") VALUES ('JEmLqxWetcx4YZskM5RF', 'craig2', '2011-10-19 08:02:23.712825', '2011-10-19 08:02:23.712825', 'rixhamc2@gmail.com', 'da737056b2782e422e11f9d57123af798b6b53588cc6f9e1d8d5333576d857f5e8346a91efcfb605144d0786e6a8cc6252b67b5d6b6c735a138e35bd770dcc8b', '3481e16790d85d2bf24d889ce3cc1005dd4d2af1e45c4dbdadd59bf479e3bef014c23c11c13a2eec717c4d4ba1af978a044c87aae01cd534a7ad168481aa666b')
---
  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save